#include "config.h"
#include "ADXL345.h"


unsigned char xdata BUF[8];  //接收数据缓存区

//**********************************************************************
//函数名：Delay5us()
//输入  ：无
//输出  ：无
//功能描述：产生延时5us
//***********************************************************************
void Delay5us()
{  
     unsigned char a;
    for(a=26;a>0;a--);

 
}

//**********************************************************************
//函数名：Delay5ms()
//输入  ：无
//输出  ：无
//功能描述：产生延时5ms
//***********************************************************************
void Delay5ms()
{
       unsigned char a,b,c;
       for(c=7;c>0;c--)
        for(b=168;b>0;b--)
            for(a=22;a>0;a--);
}

//**********************************************************************
//函数名：ADXL345_Start()
//输入  ：无
//输出  ：无
//功能描述：产生IIC时序的起始信号
//**********************************************************************
void ADXL345_Start()
{
    SDA = 1;                    //拉高数据线
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时,即保证SDA及SCL为高电平
    SDA = 0;                    //产生下降沿
    Delay5us();                 //延时，参考ADXL345的中文技术手册P18的t4.
    SCL = 0;                    //拉低时钟线
}

//**********************************************************************
//函数名：ADXL345_Stop()
//输入  ：无
//输出  ：无
//功能描述：产生IIC时序的停止信号
//**********************************************************************
void ADXL345_Stop()
{
    SDA = 0;                    //拉低数据线
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时参考ADXL345的中文技术手册P18的t8.
    SDA = 1;                    //产生上升沿
    Delay5us();                 //延时,普通延时
}

//**********************************************************************
//函数名：ADXL345_SendACK(bit ack)
//输入  ：ack(0:ACK 1:NAK)
//输出  ：无
//功能描述：发送应答信号
//***********************************************************************
void ADXL345_SendACK(bit ack)
{
    SDA = ack;                  //写应答信号
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    SCL = 0;                    //拉低时钟线
    Delay5us();                 //延时
}


//**********************************************************************
//函数名：ADXL345_RecvACK()
//输入  ：无
//输出  ：ack(0:ACK 1:NAK)
//功能描述：接收应答信号
//***********************************************************************
bit ADXL345_RecvACK()
{
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    CY = SDA;                   //读应答信号
    SCL = 0;                    //拉低时钟线
    Delay5us();                 //延时

    return CY;
}

//**********************************************************************
//函数名：ADXL345_SendByte(BYTE dat)
//输入  ：发送的数据字节信息
//输出  ：无
//功能描述：向IIC总线发送一个字节数据
//**********************************************************************
void ADXL345_SendByte(BYTE dat)
{
    BYTE i;

    for (i=0; i<8; i++)         //8位计数器
    {
        dat <<= 1;              //移出数据的最高位
        SDA = CY;               //送数据口
        SCL = 1;                //拉高时钟线
        Delay5us();             //延时
        SCL = 0;                //拉低时钟线
        Delay5us();             //延时
    }
    ADXL345_RecvACK();
}

//**********************************************************************
//函数名：ADXL345_RecvByte()
//输入  ：无
//输出  ：返回单字节信息
//功能描述：从IIC总线接收一个字节数据
//*********************************************************************
BYTE ADXL345_RecvByte()
{
    BYTE i;
    BYTE dat = 0;

    SDA = 1;                    //使能内部上拉,准备读取数据,
    for (i=0; i<8; i++)         //8位计数器
    {
        dat <<= 1;
        SCL = 1;                //拉高时钟线
        Delay5us();             //延时
        dat |= SDA;             //读数据               
        SCL = 0;                //拉低时钟线
        Delay5us();             //延时
    }
    return dat;
}

//**********************************************************************
//函数名：Single_Write_ADXL345(uchar REG_Address,uchar REG_data)
//输入  ：寄存器地址及要写入的字节数据
//输出  ：无
//功能描述：向指定的寄存器写一个字节数据，过程请参考中文手册P17
//**********************************************************************
void Single_Write_ADXL345(uchar REG_Address,uchar REG_data)
{
    ADXL345_Start();                  //起始信号
    ADXL345_SendByte(SlaveAddress);   //发送设备地址+写信号
    ADXL345_SendByte(REG_Address);    //内部寄存器地址，请参考中文pdf22页 
    ADXL345_SendByte(REG_data);       //内部寄存器数据，请参考中文pdf22页 
    ADXL345_Stop();                   //发送停止信号
}

//**********************************************************************
//函数名：Single_Read_ADXL345(uchar REG_Address)
//输入  ：要读取寄存器数据的地址
//输出  ：寄存器数据
//功能描述：从IIC总线读取指定寄存器字节数据，过程请参考中文手册P17
//**********************************************************************
uchar Single_Read_ADXL345(uchar REG_Address)
{  uchar REG_data;
    ADXL345_Start();                          //起始信号
    ADXL345_SendByte(SlaveAddress);           //发送设备地址+写信号
    ADXL345_SendByte(REG_Address);            //发送存储单元地址，从0开始	
    ADXL345_Start();                          //起始信号
    ADXL345_SendByte(SlaveAddress+1);         //发送设备地址+读信号
    REG_data=ADXL345_RecvByte();              //读出寄存器数据
	ADXL345_SendACK(1);   
	ADXL345_Stop();                           //停止信号
    return REG_data; 
}

//**********************************************************************
//函数名：Multiple_read_ADXL345(void)
//输入  ：无
//输出  ：无
//功能描述：连续读出ADXL345内部加速度数据，地址范围0x32~0x37，过程请参考中文手册P17
//          把从ADXL345读取的X,Y,Z共6个字节数据存放在BUF[]缓存中
//***********************************************************************
void Multiple_read_ADXL345(void)
{   uchar i;
    ADXL345_Start();                          //起始信号
    ADXL345_SendByte(SlaveAddress);           //发送设备地址+写信号
    ADXL345_SendByte(0x32);                   //发送存储单元地址，从0x32开始	
    ADXL345_Start();                          //起始信号
    ADXL345_SendByte(SlaveAddress+1);         //发送设备地址+读信号
	 for (i=0; i<6; i++)                      //连续读取6个地址数据，存储中BUF
    {
        BUF[i] = ADXL345_RecvByte();          //BUF[0]存储0x32地址中的数据
        if (i == 5)
        {
           ADXL345_SendACK(1);                //最后一个数据需要回NOACK
        }
        else
        {
          ADXL345_SendACK(0);                //回应ACK
       }
   }
    ADXL345_Stop();                          //停止信号
    Delay5ms();
}

//**********************************************************************
//函数名：Init_ADXL345()
//输入  ：无
//输出  ：无
//功能描述：初始化ADXL345，过程请参考ADCL345快速入门P3及P6
//**********************************************************************
void Init_ADXL345()
{
   Single_Write_ADXL345(0x31,0x0b);   //测量范围,正负16g，13位模式
   Single_Write_ADXL345(0x2C,0x0A);   //速率设定为100 参考pdf13页
   Single_Write_ADXL345(0x2D,0x08);   //选择电源模式为测量模式，参考pdf24页
   Single_Write_ADXL345(0x2E,0x80);   //使能 DATA_READY 中断
   Single_Write_ADXL345(0x1E,0xfa);   //X 偏移量 根据测试传感器的状态写入pdf29页
   Single_Write_ADXL345(0x1F,0xfd);   //Y 偏移量 根据测试传感器的状态写入pdf29页
   Single_Write_ADXL345(0x20,0x06);   //Z 偏移量 根据测试传感器的状态写入pdf29页
}